In [1]:
import pandas as pd
import numpy as np

In [10]:
obj = pd.Series([4, ["7"], -5, {3: 5}])
obj

0         4
1       [7]
2        -5
3    {3: 5}
dtype: object

In [12]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [13]:
obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])

In [14]:
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [15]:
obj2 > 0

d     True
b     True
a    False
c     True
dtype: bool

In [16]:
obj2["hello"] = 55

In [17]:
obj2

d         4
b         7
a        -5
c         3
hello    55
dtype: int64

In [18]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}
obj3 = pd.Series(sdata)

In [19]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [22]:
s1 = pd.Series({'a': 1, 'b': 2, 'c': 3, 'g': 15})
s2 = pd.Series({'b': 3, 'c': 4, 'd': 5})

In [23]:
s1+s2

a    NaN
b    5.0
c    7.0
d    NaN
g    NaN
dtype: float64

In [136]:
states = ["California", "Ohio", "Oregon", "Texas"]
obj2= pd.Series(sdata, index=states)

In [137]:
obj2.index = ['hello', '1', '2', '4']

In [29]:
obj4[pd.notna(obj4)]

Ohio      35000.0
Oregon    16000.0
Texas     71000.0
dtype: float64

In [30]:
obj4.name = "population"
obj4.index.name = 'State'

In [31]:
obj4

State
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [32]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [33]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [34]:
frame.head(4)

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4

In [35]:
frame.tail(2)

    state  year  pop
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [59]:
frame = pd.DataFrame(data, columns=["year", "state", "pop", 'debt'])

In [60]:
frame.debt = np.arange(6)

In [61]:
frame.debt

0    0
1    1
2    2
3    3
4    4
5    5
Name: debt, dtype: int64

In [62]:
frame

   year   state  pop  debt
0  2000    Ohio  1.5     0
1  2001    Ohio  1.7     1
2  2002    Ohio  3.6     2
3  2001  Nevada  2.4     3
4  2002  Nevada  2.9     4
5  2003  Nevada  3.2     5

In [63]:
val = pd.Series([-1.2, -1.5, -1.7], index=[2, 4, 5])

In [64]:
val

2   -1.2
4   -1.5
5   -1.7
dtype: float64

In [65]:
frame["debt"] = val

In [66]:
frame

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [99]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
                "Nevada": {2001: 2.4, 2002: 2.9}}

In [100]:
populations

{'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}, 'Nevada': {2001: 2.4, 2002: 2.9}}

In [101]:
frame3 = pd.DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [139]:
frame3.index

Index([2000, 2001, 2002], dtype='int64')

In [123]:
pd.DataFrame(populations, index=[2001, 2002, 2003]).index

Index([2001, 2002, 2003], dtype='int64')

In [93]:
test = {'hey': [1, 2],
        'hello': [1]}

In [102]:
sdata.ndim

AttributeError: 'dict' object has no attribute 'ndim'

In [104]:
s1.ndim

1

In [118]:
twod_array = np.ones([3, 2])

In [119]:
twod_array

array([[1., 1.],
       [1., 1.],
       [1., 1.]])

In [120]:
twod_array.ndim

2

In [122]:
pd.DataFrame(twod_array)

     0    1
0  1.0  1.0
1  1.0  1.0
2  1.0  1.0

In [124]:
obj = pd.Series(np.arange(3), index=["a", "b", "c"])

In [132]:
obj.index

Index(['a', 'b', 'c'], dtype='object')

In [133]:
labels = pd.Index(np.arange(3))

In [134]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [135]:
obj2.index is labels

True

In [142]:
pd.Series([1, ['g', 'g']])

<NumpyExtensionArray>
[1, ['g', 'g']]
Length: 2, dtype: object

In [143]:
data = {
    "product_name": ["Laptop", "Smartphone", "Keyboard", "Tablet", "Headphones", "Router", "PC"],
    "quantity": [1, 2, 1, 3, 1, 2, 4],
    "price": [1200, 800, 120, 300, 150, 200, 1300],
    "order_date": ["2024-07-01", "2024-07-03", "2024-07-05", "2024-07-07", "2024-07-09", "2024-07-10", "2024-07-02"],
}

sales_info = pd.DataFrame(data)
print(sales_info)

  product_name  quantity  price  order_date
0       Laptop         1   1200  2024-07-01
1   Smartphone         2    800  2024-07-03
2     Keyboard         1    120  2024-07-05
3       Tablet         3    300  2024-07-07
4   Headphones         1    150  2024-07-09
5       Router         2    200  2024-07-10
6           PC         4   1300  2024-07-02

In [150]:
sales_info.values

array([['Laptop', 1, 1200, '2024-07-01'],
       ['Smartphone', 2, 800, '2024-07-03'],
       ['Keyboard', 1, 120, '2024-07-05'],
       ['Tablet', 3, 300, '2024-07-07'],
       ['Headphones', 1, 150, '2024-07-09'],
       ['Router', 2, 200, '2024-07-10'],
       ['PC', 4, 1300, '2024-07-02']], dtype=object)

In [151]:
sales_info.shape

(7, 4)

In [152]:
sales_info.dtypes

product_name    object
quantity         int64
price            int64
order_date      object
dtype: object

In [153]:
sales_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   product_name  7 non-null      object
 1   quantity      7 non-null      int64
 2   price         7 non-null      int64
 3   order_date    7 non-null      object
dtypes: int64(2), object(2)
memory usage: 352.0+ bytes

In [155]:
sales_info.describe()

       quantity        price
count  7.000000     7.000000
mean   2.000000   581.428571
std    1.154701   511.612763
min    1.000000   120.000000
25%    1.000000   175.000000
50%    2.000000   300.000000
75%    2.500000  1000.000000
max    4.000000  1300.000000

In [157]:
sales_info.value_counts()

product_name  quantity  price  order_date
Headphones    1         150    2024-07-09    1
Keyboard      1         120    2024-07-05    1
Laptop        1         1200   2024-07-01    1
PC            4         1300   2024-07-02    1
Router        2         200    2024-07-10    1
Smartphone    2         800    2024-07-03    1
Tablet        3         300    2024-07-07    1
Name: count, dtype: int64

In [158]:
print(f"Unique values: {sales_info['product_name'].unique()}")
print(f"Number of unique values: {sales_info['product_name'].nunique()}")

Unique values: ['Laptop' 'Smartphone' 'Keyboard' 'Tablet' 'Headphones' 'Router' 'PC']
Number of unique values: 7

In [2]:
usd_data = pd.read_json("https://api.exchangerate-api.com/v4/latest/USD")
usd_data.head()

,provider,WARNING_UPGRADE_TO_V6,terms,base,date,time_last_updated,rates
USD,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,USD,2025-03-23,1742688001,1.00
AED,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,USD,2025-03-23,1742688001,3.67
AFN,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,USD,2025-03-23,1742688001,71.04
ALL,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,USD,2025-03-23,1742688001,91.04
AMD,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,USD,2025-03-23,1742688001,392.31

In [4]:
data = {
    "product_name": ["Laptop", "Smartphone", "Keyboard", "Tablet", "Headphones", "Router", "PC"],
    "quantity": [1, 2, 1, 3, 1, 2, 4],
    "price": [1200, 800, 120, 300, 150, 200, 1300],
    "order_date": ["2024-07-01", "2024-07-03", "2024-07-05", "2024-07-07", "2024-07-09", "2024-07-10", "2024-07-02"],
}

sales_info = pd.DataFrame(data)

In [5]:
sales_info

  product_name  quantity  price  order_date
0       Laptop         1   1200  2024-07-01
1   Smartphone         2    800  2024-07-03
2     Keyboard         1    120  2024-07-05
3       Tablet         3    300  2024-07-07
4   Headphones         1    150  2024-07-09
5       Router         2    200  2024-07-10
6           PC         4   1300  2024-07-02

In [6]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])

In [7]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [9]:
obj2 = obj.reindex(["a", "b", "c", "d", "e"])

In [10]:
obj2.size

5

In [11]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [12]:
obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])

In [13]:
new_obj = obj.drop("c")

In [14]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [16]:
obj.b

np.float64(1.0)

In [17]:
obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])

In [20]:
obj1[0:2]

2    1
0    2
dtype: int64

In [21]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [25]:
sales_info.loc[:5, ['product_name', 'price']]

  product_name  price
0       Laptop   1200
1   Smartphone    800
2     Keyboard    120
3       Tablet    300
4   Headphones    150
5       Router    200

In [23]:
sales_info

  product_name  quantity  price  order_date
0       Laptop         1   1200  2024-07-01
1   Smartphone         2    800  2024-07-03
2     Keyboard         1    120  2024-07-05
3       Tablet         3    300  2024-07-07
4   Headphones         1    150  2024-07-09
5       Router         2    200  2024-07-10
6           PC         4   1300  2024-07-02

In [26]:
sales_info.index = ['A', 'B', 'C', 'D', 'E', 'F', 'G']

In [27]:
sales_info

  product_name  quantity  price  order_date
A       Laptop         1   1200  2024-07-01
B   Smartphone         2    800  2024-07-03
C     Keyboard         1    120  2024-07-05
D       Tablet         3    300  2024-07-07
E   Headphones         1    150  2024-07-09
F       Router         2    200  2024-07-10
G           PC         4   1300  2024-07-02

In [29]:
sales_info.loc[:'F', ['product_name', 'price']]

  product_name  price
A       Laptop   1200
B   Smartphone    800
C     Keyboard    120
D       Tablet    300
E   Headphones    150
F       Router    200

In [30]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
   index=["Ohio", "Colorado", "Utah", "New York"],
   columns=["one", "two", "three", "four"])

In [31]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [35]:
data[:]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [36]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [40]:
data.iloc[:, :3]

/var/folders/76/p9ls0c8576d26f9v9n864tq80000gn/T/ipykernel_21019/2180583950.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  data.iloc[:, :3][data.three > 5][data.three > 10]

          one  two  three
New York   12   13     14

In [41]:
ser = pd.Series(np.arange(3.))

In [44]:
ser.iloc[-1]

np.float64(2.0)

In [51]:
ser[[1, 2]]

1    1.0
2    2.0
dtype: float64

In [52]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=["a", "c", "e", "f", "g"])

In [54]:
s1.add(s2, fill_value=0)

a    5.2
c    1.1
d    3.4
e    0.0
f    4.0
g    3.1
dtype: float64

In [55]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list("bcd"),
   index=["Ohio", "Texas", "Colorado"])

df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"),
   index=["Utah", "Ohio", "Texas", "Oregon"])

In [56]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [57]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [63]:
df1.add(df2, fill_value=0)

            b    c     d     e
Colorado  6.0  7.0   8.0   NaN
Ohio      3.0  1.0   6.0   5.0
Oregon    9.0  NaN  10.0  11.0
Texas     9.0  4.0  12.0   8.0
Utah      0.0  NaN   1.0   2.0

In [64]:
df1 = pd.DataFrame({"A": [1, 2]})
df2 = pd.DataFrame({"B": [3, 4]})

In [65]:
df1 + df2

    A   B
0 NaN NaN
1 NaN NaN

In [66]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
   columns=list("abcd"))

df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
   columns=list("abcde"))

In [67]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [68]:
df2.loc[1, "b"] = np.nan

In [69]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [70]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [72]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [73]:
frame = pd.DataFrame({"b": [4.3, 7, -3, 2], "a": [0, 1, 0, 1], "c": [-2, 5, 8, -2.5]})

In [74]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [76]:
frame.rank(axis="columns")

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [78]:
frame.rank()

     b    a    c
0  3.0  1.5  2.0
1  4.0  3.5  3.0
2  1.0  1.5  4.0
3  2.0  3.5  1.0

In [79]:
obj = pd.Series(np.arange(5), index=["a", "a", "b", "b", "c"])

In [81]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [82]:
obj.index.is_unique

False

In [90]:
float_data = pd.Series([1, -3, np.nan, 0])

In [91]:
float_data

0    1.0
1   -3.0
2    NaN
3    0.0
dtype: float64

In [92]:
values = pd.Series([0, 1, 0, 0] * 2)
dim = pd.Series(['apple', 'orange'])

In [93]:
values

0    0
1    1
2    0
3    0
4    0
5    1
6    0
7    0
dtype: int64

In [94]:
dim

0     apple
1    orange
dtype: object

In [95]:
dim.take(values)

0     apple
1    orange
0     apple
0     apple
0     apple
1    orange
0     apple
0     apple
dtype: object

In [96]:
N = 10_000_000
labels = pd.Series(['foo', 'bar', 'baz', 'qux'] * (N // 4))
labels.size

10000000

In [97]:
mobile_data = pd.read_csv("mobile_sales.csv", nrows=100)

In [98]:
mobile_data.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,176558,USB-C Charging Cable,2,11.95,04/19/19 8:46,"917 1st St, Dallas, TX 75001"
1,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"
2,176560,Google Phone,1,600,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
3,176560,Wired Headphones,1,11.99,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
4,176561,Wired Headphones,1,11.99,04/30/19 9:27,"333 8th St, Los Angeles, CA 90001"

In [105]:
mobile_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Order ID          100 non-null    int64
 1   Product           100 non-null    object
 2   Quantity Ordered  100 non-null    int64
 3   Price Each        100 non-null    float64
 4   Order Date        100 non-null    object
 5   Purchase Address  100 non-null    object
dtypes: float64(1), int64(2), object(3)
memory usage: 4.8+ KB

In [100]:
mobile_data.describe()

            Order ID  Quantity Ordered
count     100.000000        100.000000
mean   176604.330000          1.150000
std        27.969339          0.411329
min    176558.000000          1.000000
25%    176580.750000          1.000000
50%    176603.500000          1.000000
75%    176628.250000          1.000000
max    176653.000000          3.000000

In [102]:
mobile_data["Price Each"] = mobile_data["Price Each"].str.replace(",", ".").astype(float)

In [104]:
mobile_data["Price Each"] = mobile_data["Price Each"].astype(float)

In [106]:
mobile_data["Order Date"] = pd.to_datetime(mobile_data["Order Date"], format="%m/%d/%y %H:%M")

In [114]:
mobile_data["Purchase Address"].str.split(",").str[0]

0          917 1st St
1     682 Chestnut St
2       669 Spruce St
3       669 Spruce St
4          333 8th St
           ...
95        702 11th St
96       153 River St
97       997 South St
98        502 14th St
99    285 Chestnut St
Name: Purchase Address, Length: 100, dtype: object

In [116]:
mobile_data[["address", "city", "zip_code"]] = mobile_data["Purchase Address"].str.split(",", expand=True)

In [117]:
mobile_data

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,address,city,zip_code
0,176558,USB-C Charging Cable,2,11.95,2019-04-19 08:46:00,"917 1st St, Dallas, TX 75001",917 1st St,Dallas,TX 75001
1,176559,Bose SoundSport Headphones,1,99.99,2019-04-07 22:30:00,"682 Chestnut St, Boston, MA 02215",682 Chestnut St,Boston,MA 02215
2,176560,Google Phone,1,600.00,2019-04-12 14:38:00,"669 Spruce St, Los Angeles, CA 90001",669 Spruce St,Los Angeles,CA 90001
3,176560,Wired Headphones,1,11.99,2019-04-12 14:38:00,"669 Spruce St, Los Angeles, CA 90001",669 Spruce St,Los Angeles,CA 90001
4,176561,Wired Headphones,1,11.99,2019-04-30 09:27:00,"333 8th St, Los Angeles, CA 90001",333 8th St,Los Angeles,CA 90001
...,...,...,...,...,...,...,...,...,...
95,176649,USB-C Charging Cable,1,11.95,2019-04-09 08:49:00,"702 11th St, San Francisco, CA 94016",702 11th St,San Francisco,CA 94016
96,176650,Lightning Charging Cable,1,14.95,2019-04-12 16:47:00,"153 River St, Boston, MA 02215",153 River St,Boston,MA 02215
97,176651,iPhone,1,700.00,2019-04-07 13:14:00,"997 South St, Boston, MA 02215",997 South St,Boston,MA 02215
98,176652,LG Washing Machine,1,600.00,2019-04-09 20:04:00,"502 14th St, New York City, NY 10001",502 14th St,New York City,NY 10001
99,176653,AA Batteries (4-pack),1,3.84,2019-04-26 19:20:00,"285 Chestnut St, San Francisco, CA 94016",285 Chestnut St,San Francisco,CA 94016

In [118]:
data = {
    "order_id": [101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111],
    "product": [
        "Laptop",
        "Smartphone",
        "Laptop",
        "Tablet",
        "Smartphone",
        "Tablet",
        "Smartwatch",
        "Laptop",
        "Headphones",
        "Smartwatch",
        "Laptop",
    ],
    "category": [
        "Electronics",
        "Electronics",
        "Electronics",
        "Electronics",
        "Electronics",
        "Electronics",
        "Wearables",
        "Electronics",
        "Accessories",
        "Wearables",
        "Electronics",
    ],
    "region": [
        "North",
        "South",
        "East",
        "North",
        "West",
        "South",
        "East",
        "West",
        "North",
        "West",
        "East",
    ],
    "sales": [1200, 800, 1550, 500, 850, 400, 300, 2200, 150, 350, 400],
}

df = pd.DataFrame(data)

In [119]:
ва

NameError: name 'ва' is not defined

In [120]:
df

    order_id     product     category region  sales
0        101      Laptop  Electronics  North   1200
1        102  Smartphone  Electronics  South    800
2        103      Laptop  Electronics   East   1550
3        104      Tablet  Electronics  North    500
4        105  Smartphone  Electronics   West    850
5        106      Tablet  Electronics  South    400
6        107  Smartwatch    Wearables   East    300
7        108      Laptop  Electronics   West   2200
8        109  Headphones  Accessories  North    150
9        110  Smartwatch    Wearables   West    350
10       111      Laptop  Electronics   East    400

In [129]:
pd.pivot_table(df, values="sales", index="product", aggfunc='sum')

            sales
product
Headphones    150
Laptop       5350
Smartphone   1650
Smartwatch    650
Tablet        900